This is the plan

```
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.s3.aws_s3_bucket.ignition will be updated in-place
  ~ resource "aws_s3_bucket" "ignition" {
        acl                         = "private"
        arn                         = "arn:aws:s3:::084190472784-ginger-ignition"
        bucket                      = "084190472784-ginger-ignition"
        bucket_domain_name          = "084190472784-ginger-ignition.s3.amazonaws.com"
        bucket_regional_domain_name = "084190472784-ginger-ignition.s3.eu-west-1.amazonaws.com"
        force_destroy               = true
        hosted_zone_id              = "Z1BKCTXD74EZPE"
        id                          = "084190472784-ginger-ignition"
        region                      = "eu-west-1"
        request_payer               = "BucketOwner"
        tags                        = {
            "Name"                         = "ginger-ignition"
            "giantswarm.io/installation"   = "ginger"
            "kubernetes.io/cluster/ginger" = "owned"
        }

      - logging {
          - target_bucket = "ginger-access-logs" -> null
          - target_prefix = "ginger-ignition-logs/" -> null
        }
      + logging {
          + target_bucket = (known after apply)
          + target_prefix = "ginger-ignition-logs/"
        }

        server_side_encryption_configuration {
            rule {
                apply_server_side_encryption_by_default {
                    sse_algorithm = "AES256"
                }
            }
        }

        versioning {
            enabled    = false
            mfa_delete = false
        }
    }

  # module.s3.aws_s3_bucket.logging must be replaced
+/- resource "aws_s3_bucket" "logging" {
      + acceleration_status         = (known after apply)
        acl                         = "log-delivery-write"
      ~ arn                         = "arn:aws:s3:::ginger-access-logs" -> (known after apply)
      ~ bucket                      = "ginger-access-logs" -> "084190472784-ginger-access-logs" # forces replacement
      ~ bucket_domain_name          = "ginger-access-logs.s3.amazonaws.com" -> (known after apply)
      ~ bucket_regional_domain_name = "ginger-access-logs.s3.eu-west-1.amazonaws.com" -> (known after apply)
        force_destroy               = true
      ~ hosted_zone_id              = "Z1BKCTXD74EZPE" -> (known after apply)
      ~ id                          = "ginger-access-logs" -> (known after apply)
      ~ region                      = "eu-west-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      ~ tags                        = {
          ~ "Name"                         = "ginger-access-logs" -> "084190472784-ginger-access-logs"
            "giantswarm.io/installation"   = "ginger"
            "kubernetes.io/cluster/ginger" = "owned"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      ~ lifecycle_rule {
          - abort_incomplete_multipart_upload_days = 0 -> null
            enabled                                = true
            id                                     = "ExpirationLogs"
          - tags                                   = {} -> null

          - expiration {
              - days                         = 365 -> null
              - expired_object_delete_marker = false -> null
            }
          + expiration {
              + days = 365
            }
        }

        logging {
            target_bucket = "ginger-access-logs"
            target_prefix = "self-logs/"
        }

      ~ server_side_encryption_configuration {
          ~ rule {
              ~ apply_server_side_encryption_by_default {
                    sse_algorithm = "AES256"
                }
            }
        }

      ~ versioning {
          ~ enabled    = false -> (known after apply)
          ~ mfa_delete = false -> (known after apply)
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.
```